In [464]:
import numpy as np
import pandas as pd 
from statsmodels import api as sm

In [465]:
untradable = pd.read_pickle("./data/UNTRADABLE.pkl")
blacklist = pd.read_pickle("./data/BLACKLIST.pkl")

In [466]:
blacklist.reset_index()[blacklist.reset_index()["asset"]=="T00018.SH"]
untradable.reset_index()[untradable.reset_index()["asset"]=="T00018.SH"]

            date      asset
7747  2001-03-26  T00018.SH
9081  2001-06-25  T00018.SH
10203 2001-10-23  T00018.SH
12901 2002-05-31  T00018.SH
12917 2002-06-03  T00018.SH
15545 2003-03-28  T00018.SH
17624 2003-07-18  T00018.SH
18486 2003-10-15  T00018.SH
20913 2004-05-14  T00018.SH
22364 2004-08-20  T00018.SH
25059 2005-04-18  T00018.SH
27395 2005-06-20  T00018.SH
27476 2005-06-21  T00018.SH
27570 2005-06-22  T00018.SH
27650 2005-06-23  T00018.SH
27742 2005-06-24  T00018.SH
27844 2005-06-27  T00018.SH
27995 2005-06-28  T00018.SH
28091 2005-06-29  T00018.SH
28204 2005-06-30  T00018.SH
28261 2005-07-01  T00018.SH
28320 2005-07-04  T00018.SH
29018 2005-07-28  T00018.SH
29077 2005-07-29  T00018.SH
29144 2005-08-01  T00018.SH
29209 2005-08-02  T00018.SH
29271 2005-08-03  T00018.SH
29329 2005-08-04  T00018.SH
29385 2005-08-05  T00018.SH
29448 2005-08-08  T00018.SH
29502 2005-08-09  T00018.SH
29556 2005-08-10  T00018.SH
29613 2005-08-11  T00018.SH
29666 2005-08-12  T00018.SH
29721 2005-08-15  T00018.SH
29777 2005-08-16  T00018.SH
29822 2005-08-17  T00018.SH
29863 2005-08-18  T00018.SH
29902 2005-08-19  T00018.SH
48846 2006-03-24  T00018.SH
59541 2006-05-30  T00018.SH
59787 2006-05-31  T00018.SH
60018 2006-06-01  T00018.SH
60269 2006-06-02  T00018.SH
60516 2006-06-05  T00018.SH
60758 2006-06-06  T00018.SH
69548 2006-08-07  T00018.SH
74166 2006-09-26  T00018.SH
74274 2006-09-27  T00018.SH
74387 2006-09-28  T00018.SH
74499 2006-09-29  T00018.SH
74620 2006-10-09  T00018.SH
74739 2006-10-10  T00018.SH
74852 2006-10-11  T00018.SH
74965 2006-10-12  T00018.SH
75076 2006-10-13  T00018.SH
75192 2006-10-16  T00018.SH
75294 2006-10-17  T00018.SH
75393 2006-10-18  T00018.SH
75495 2006-10-19  T00018.SH

In [467]:
ff5 = pd.read_csv("./data/FF5.csv")
ff5["date"] = pd.to_datetime(ff5["date"])
ff5["time"] = ff5["date"].dt.to_period("M")     # 日期不一样，保留月份方便merge
price = pd.read_hdf("./data/price.h5")
ret = pd.read_pickle("./data/monthly_returns.pkl")

In [468]:
ret.head()

asset,000001.SZ,000002.SZ,000003.SZ,000004.SZ,000005.SZ,000006.SZ,000007.SZ,000008.SZ,000009.SZ,000010.SZ,...,688788.SH,688789.SH,688793.SH,688798.SH,688799.SH,688800.SH,688819.SH,688981.SH,689009.SH,T00018.SH
date,,,,,,,,,,,,,,,,,,,,,
1995-02-28,0.008539,-0.007181,0.000000,0.005386,0.061837,-0.033824,-0.015748,-0.016484,-0.010941,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1995-03-31,0.012230,0.019892,0.018083,0.032143,0.001664,0.016743,0.076000,0.052142,0.019912,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1995-04-30,-0.099442,-0.108156,-0.115453,-0.169550,-0.106312,-0.175150,-0.197026,-0.146903,-0.097614,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1995-05-31,0.011352,-0.003976,0.004016,0.052083,0.040892,0.143376,-0.004630,0.000000,0.016827,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1995-06-30,-0.064286,-0.035928,-0.082000,-0.099010,-0.132143,-0.082540,-0.074419,-0.070539,-0.080378,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [469]:
rf = pd.read_csv("./data/risk_free.csv")
rf["time"] = pd.to_datetime(rf["date"]).dt.to_period("M")
# rf.drop(columns="date", inplace=True)
rf = rf.groupby(["time"])["RF"].mean().reset_index()
rf.head(3)

      time        RF
0  1995-01  0.000182
1  1995-02  0.000182
2  1995-03  0.000182

# 关键变量

In [470]:
# window = 30
# window = 15
# window = 10
window = 5
# window = 3

In [471]:
ff5.head(3)

        date       MKT       SMB       HML       RMW       CMA     time
0 1995-01-31 -0.129807  0.001446  0.059888  0.000788 -0.036327  1995-01
1 1995-02-28 -0.021905  0.011970  0.036737 -0.045592 -0.017638  1995-02
2 1995-03-31  0.151193 -0.032453 -0.222268  0.084092  0.019449  1995-03

In [472]:
price.head(3)       # 日频 price

asset,000001.SZ,000002.SZ,000003.SZ,000004.SZ,000005.SZ,000006.SZ,000007.SZ,000008.SZ,000009.SZ,000010.SZ,...,873693.BJ,873703.BJ,873706.BJ,873726.BJ,873806.BJ,873833.BJ,920002.BJ,920008.BJ,920118.BJ,T00018.SH
date,,,,,,,,,,,,,,,,,,,,,
1995-01-03,60.52512,23.82854,19.12960,17.13948,10.96780,13.60100,9.92006,8.85000,9.98455,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1995-01-04,63.00936,24.17612,19.41184,17.69868,11.45326,13.86364,10.27246,9.04175,10.08380,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1995-01-05,62.78352,23.75130,19.12960,17.25132,11.27346,13.73232,10.27246,8.95325,9.96470,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [473]:
# 先把 price 处理成一列 index 多列股票price的格式
# price2 = price.reset_index()
# price2.columns

# 保留月份
# price2["time"] = price2["date"].dt.to_period("M")
# price2.head(3)

# ret = price2.pct_change()

# ret.head(3)

# price3 = price2.drop(columns="date").melt()
price3 = pd.melt(price.reset_index(), id_vars="date", value_vars=price.reset_index().drop(columns=["date"]).columns, value_name="price", var_name="id")
price3.head()

# ret = price3[["time", "id", "price"]].copy()
# ret["ret"] = price3.groupby("id")["price"].transform(lambda x: x.pct_change()).dropna()
# ret.head()      # 日频 return
ret2 = ret.reset_index()
ret2["time"] = ret2["date"].dt.to_period("M")
ret2.head(3)

ret3 = pd.melt(ret2.drop(columns="date"), id_vars="time", value_vars=ret2.drop(columns=["date", "time"]).columns, value_name="ret", var_name="id").dropna()
ret3.head()
price3["time"] = price3["date"].dt.to_period("M")
price4 = price3.groupby(["id", "time"]).last().reset_index()
price4.head()

          id     time       date     price
0  000001.SZ  1995-01 1995-01-27  59.50884
1  000001.SZ  1995-02 1995-02-28  60.01698
2  000001.SZ  1995-03 1995-03-31  60.75096
3  000001.SZ  1995-04 1995-04-28  54.70974
4  000001.SZ  1995-05 1995-05-31  55.33080

In [474]:
# 转月频
# ret2 = ret.groupby(["time", "id"])["ret"].apply(lambda x: (x+1).prod()-1)
# ret2[ret2["id"]=="T00018.SH"].tail()

In [475]:
# 验证
# ret3 = ret2.reset_index()
# # ret3[ret3["id"] == "000001.SZ"]
# # 认为这个是return吧
# ret3[ret3["id"]=="T00018.SH"].tail()

In [476]:
# ret3[ret3["id"] == "T00018.SH"]

# 1. CAPM beta

In [477]:
# regress return on MKT factor

# merge ff5["date", "MKT"] with 
df1 = pd.merge(ret3, ff5.drop(columns=["date"]), on="time", how="left")

df2 = df1.copy()
df2 = pd.merge(df2, rf, on="time", how="left")
df2 = df2[df2["time"] >= "2003-01"].reset_index().drop(columns=["index"])
df2.head()

,time,id,ret,MKT,SMB,HML,RMW,CMA,RF
0,2003-01,000001.SZ,0.108675,0.094457,0.031825,0.096895,-0.030763,-0.043969,0.000062
1,2003-02,000001.SZ,-0.030954,0.008670,0.013230,-0.002785,-0.012716,-0.050444,0.000062
2,2003-03,000001.SZ,0.046140,-0.006912,-0.064266,0.002854,0.064583,0.026581,0.000062
3,2003-04,000001.SZ,0.054283,-0.000120,-0.138065,0.045283,0.125030,-0.026870,0.000062
4,2003-05,000001.SZ,0.009654,0.040754,-0.011330,0.029283,-0.012274,-0.013981,0.000060

In [478]:
df2[df2["id"]=="T00018.SH"].tail()

,time,id,ret,MKT,SMB,HML,RMW,CMA,RF
727940,2024-04,T00018.SH,0.0,0.014445,-0.083869,0.025769,0.064231,-0.036332,0.000057
727941,2024-05,T00018.SH,0.0,-0.008524,-0.003845,0.058808,0.020994,0.001726,0.000054
727942,2024-06,T00018.SH,0.0,-0.032718,-0.070248,0.043358,0.049527,-0.050652,0.000053
727943,2024-07,T00018.SH,0.0,-0.000796,0.035614,0.055507,-0.065557,0.030404,0.000052
727944,2024-08,T00018.SH,0.0,-0.031132,0.007310,0.018863,0.020073,0.011099,0.000050

In [479]:
df_capm = df2[["time", "id", "ret", "MKT", "RF"]]
df_capm["ret"] = df_capm["ret"] - df_capm["RF"]
df_capm["MKT"] = df_capm["MKT"]

C:\Users\Collins\AppData\Local\Temp\ipykernel_11072\2274023097.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_capm["ret"] = df_capm["ret"] - df_capm["RF"]
C:\Users\Collins\AppData\Local\Temp\ipykernel_11072\2274023097.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_capm["MKT"] = df_capm["MKT"]

In [480]:
def rolling_beta_regression(df, window=5, y_col='ret', x_col='MKT'):
    """
    高效的滚动回归计算beta系数
    假设数据已按时间排序，且已按id分组排序
    """
    # 确保按id分组
    grouped = df.groupby('id', group_keys=False)
    
    # 定义滚动回归函数
    def calculate_rolling_beta(group):
        # 确保按时间排序
        group = group.sort_values('time')
        
        # 提取y和x
        y = group[y_col].values
        x = group[x_col].values
        
        # 初始化结果数组
        n = len(y)
        betas = np.full(n, np.nan)
        
        # 滚动计算beta
        for i in range(window - 1, n):
            # 获取窗口数据
            y_window = y[i-window+1:i+1]
            x_window = x[i-window+1:i+1]
            
            # 计算beta: cov(x,y) / var(x)
            x_mean = np.mean(x_window)
            y_mean = np.mean(y_window)
            
            numerator = np.sum((x_window - x_mean) * (y_window - y_mean))
            denominator = np.sum((x_window - x_mean) ** 2)
            
            # 防止除零错误
            if denominator != 0:
                betas[i] = numerator / denominator
        
        # 返回结果
        return pd.DataFrame({
            'time': group['time'],
            'id': group['id'].iloc[0],
            'beta': betas
        })
    
    # 并行计算每个id的滚动beta
    results = []
    for _, group in grouped:
        results.append(calculate_rolling_beta(group))
    
    return pd.concat(results, ignore_index=True)

# 直接使用
betas_df = rolling_beta_regression(df2, window=5, y_col='ret', x_col='MKT')

# 显示结果
print(betas_df.tail(20))

           time         id  beta
727925  2023-01  T00018.SH   0.0
727926  2023-02  T00018.SH   0.0
727927  2023-03  T00018.SH   0.0
727928  2023-04  T00018.SH   0.0
727929  2023-05  T00018.SH   0.0
727930  2023-06  T00018.SH   0.0
727931  2023-07  T00018.SH   0.0
727932  2023-08  T00018.SH   0.0
727933  2023-09  T00018.SH   0.0
727934  2023-10  T00018.SH   0.0
727935  2023-11  T00018.SH   0.0
727936  2023-12  T00018.SH   0.0
727937  2024-01  T00018.SH   0.0
727938  2024-02  T00018.SH   0.0
727939  2024-03  T00018.SH   0.0
727940  2024-04  T00018.SH   0.0
727941  2024-05  T00018.SH   0.0
727942  2024-06  T00018.SH   0.0
727943  2024-07  T00018.SH   0.0
727944  2024-08  T00018.SH   0.0

In [481]:
def rolling_multi_factor_betas(df, window=5, y_col='ret'):
    """
    计算所有因子的滚动beta
    """
    # factors = ['MKT', 'SMB', 'HML', 'RMW', 'CMA']
    factors = ["MKT"]
    results = []
    
    for factor in factors:
        factor_betas = rolling_beta_regression(df, window=window, x_col=factor)
        factor_betas.rename(columns={'beta': f'beta_{factor}'}, inplace=True)
        
        if results:
            # 合并到已有结果
            results[-1] = pd.merge(results[-1], factor_betas, on=['time', 'id'])
        else:
            results.append(factor_betas)
    
    return results[0] if results else pd.DataFrame()

df_capm["ret"] = df_capm["ret"]
df_capm["MKT"] = df_capm["MKT"]
# 计算所有因子beta
all_betas = rolling_multi_factor_betas(df_capm, window=window)
print(all_betas.head(10))

C:\Users\Collins\AppData\Local\Temp\ipykernel_11072\3264797754.py:21: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_capm["ret"] = df_capm["ret"]
C:\Users\Collins\AppData\Local\Temp\ipykernel_11072\3264797754.py:22: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_capm["MKT"] = df_capm["MKT"]

      time         id  beta_MKT
0  2003-01  000001.SZ       NaN
1  2003-02  000001.SZ       NaN
2  2003-03  000001.SZ       NaN
3  2003-04  000001.SZ       NaN
4  2003-05  000001.SZ  0.707528
5  2003-06  000001.SZ  1.235338
6  2003-07  000001.SZ  1.353460
7  2003-08  000001.SZ  1.208821
8  2003-09  000001.SZ  1.117902
9  2003-10  000001.SZ  0.896230

In [482]:
all_betas[all_betas["id"]=="T00018.SH"]

           time         id  beta_MKT
727685  2003-01  T00018.SH       NaN
727686  2003-02  T00018.SH       NaN
727687  2003-03  T00018.SH       NaN
727688  2003-04  T00018.SH       NaN
727689  2003-05  T00018.SH -0.694264
...         ...        ...       ...
727940  2024-04  T00018.SH  0.000037
727941  2024-05  T00018.SH  0.000020
727942  2024-06  T00018.SH -0.000083
727943  2024-07  T00018.SH -0.000105
727944  2024-08  T00018.SH -0.000082

[260 rows x 3 columns]

In [483]:
# CAPM risk proxy
# all_betas.to_csv("capm_beta.csv")

# 2. IVOL

- ff3 的 residual

In [484]:
df_ff3 = df2[["time", "id", "ret", "MKT", "SMB", "HML", "RF"]].copy()
df_ff3["ret"] = df_ff3["ret"] - df_ff3["RF"]
df_ff3.head(3)

      time         id       ret       MKT       SMB       HML        RF
0  2003-01  000001.SZ  0.108613  0.094457  0.031825  0.096895  0.000062
1  2003-02  000001.SZ -0.031016  0.008670  0.013230 -0.002785  0.000062
2  2003-03  000001.SZ  0.046078 -0.006912 -0.064266  0.002854  0.000062

In [485]:
def rolling_multi_residuals(df, window=5, y_col='ret', x_cols=['MKT', "SMB", "HML"]):
    """
    多元滚动回归计算残差
    使用矩阵运算提高效率
    """
    results = []
    
    for id_name, group in df.groupby('id'):
        # 确保按时间排序
        group = group.sort_values('time')
        
        # 提取数据
        dates = group['time'].values
        y = group[y_col].values
        X = group[x_cols].values
        n = len(y)
        
        # 添加常数项
        X_with_const = np.column_stack([np.ones(n), X])
        
        # 初始化结果数组
        residuals = np.full(n, np.nan)
        betas_matrix = np.full((n, len(x_cols)), np.nan)
        
        # 滚动窗口计算
        for i in range(window - 1, n):
            start, end = i - window + 1, i + 1
            
            # 窗口数据
            X_window = X_with_const[start:end]
            y_window = y[start:end]
            
            try:
                # 最小二乘解: beta = (X'X)^(-1)X'y
                XtX = X_window.T @ X_window
                Xty = X_window.T @ y_window
                
                # 检查矩阵是否可逆
                if np.linalg.matrix_rank(XtX) == XtX.shape[0]:
                    beta = np.linalg.inv(XtX) @ Xty
                    
                    # 保存系数（不包括常数项）
                    betas_matrix[i, :] = beta[1:]
                    
                    # 计算当前期的残差
                    y_pred = X_with_const[i] @ beta
                    residuals[i] = y[i] - y_pred
                    
            except np.linalg.LinAlgError:
                # 矩阵不可逆，跳过
                continue
        
        # 创建结果DataFrame
        df_result = pd.DataFrame({
            'time': dates,
            'id': id_name,
            'residual': residuals
        })
        
        # 添加每个因子的beta
        for j, col in enumerate(x_cols):
            df_result[f'beta_{col}'] = betas_matrix[:, j]
        
        results.append(df_result)
    
    return pd.concat(results, ignore_index=True)

# 使用多元回归
multi_residuals = rolling_multi_residuals(
    df_ff3, 
    window=window, 
    x_cols=['MKT', 'SMB', 'HML']
)
print(multi_residuals.head(10))

      time         id  residual  beta_MKT  beta_SMB  beta_HML
0  2003-01  000001.SZ       NaN       NaN       NaN       NaN
1  2003-02  000001.SZ       NaN       NaN       NaN       NaN
2  2003-03  000001.SZ       NaN       NaN       NaN       NaN
3  2003-04  000001.SZ       NaN       NaN       NaN       NaN
4  2003-05  000001.SZ -0.011535 -0.635717  0.017843  1.644416
5  2003-06  000001.SZ  0.001794  1.372666 -1.096994 -1.547853
6  2003-07  000001.SZ -0.049128  1.315156 -0.818617 -0.652792
7  2003-08  000001.SZ  0.045964  1.050923 -0.298373 -0.017491
8  2003-09  000001.SZ -0.004624  1.494894  0.268526 -1.722942
9  2003-10  000001.SZ  0.000960  2.181129  0.703425  0.079464

In [486]:
df_ivol = multi_residuals[["time", "id", "residual"]]
df_ivol["ivol"] = df_ivol["residual"].rolling(window).std()

C:\Users\Collins\AppData\Local\Temp\ipykernel_11072\1503762660.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_ivol["ivol"] = df_ivol["residual"].rolling(window).std()

In [487]:
df_ivol.iloc[117:126]

        time         id  residual      ivol
117  2012-10  000001.SZ  0.003314  0.005857
118  2012-11  000001.SZ -0.021149  0.009830
119  2012-12  000001.SZ -0.002453  0.009460
120  2013-01  000001.SZ  0.125261  0.059237
121  2013-02  000001.SZ  0.033253  0.057963
122  2013-03  000001.SZ  0.026348  0.056441
123  2013-04  000001.SZ -0.034250  0.059748
124  2013-05  000001.SZ -0.002761  0.059789
125  2013-06  000001.SZ -0.026091  0.030245

# 3. RETVOL

直接rolling std吧

In [488]:
retvol = ret3.copy()
retvol["retvol"] = retvol["ret"].rolling(window).std()
retvol.iloc[55:65]

       time         id       ret    retvol
55  1999-09  000001.SZ -0.055172  0.287699
56  1999-10  000001.SZ -0.048201  0.262373
57  1999-11  000001.SZ -0.087581  0.112309
58  1999-12  000001.SZ -0.113763  0.089616
59  2000-01  000001.SZ  0.060172  0.066408
60  2000-02  000001.SZ -0.009730  0.068416
61  2000-03  000001.SZ  0.002729  0.070612
62  2000-04  000001.SZ  0.037561  0.067025
63  2000-05  000001.SZ -0.055614  0.044665
64  2000-06  000001.SZ  0.007222  0.033891

# 4. AGE

In [489]:
# 调出 company info
company_info = pd.read_csv("./data/Company_Info.csv")
company_info

# 直接把 Listdt 导出即可
company_info["start_time"] = pd.to_datetime(company_info["Listdt"]).dt.to_period("M")+1

# 改下stkcd
company_info["id2"] = company_info["Stkcd"].astype(str).str.extract('(\d+)')[0].str.zfill(6)
company_info.drop(columns=["Stkcd", "DelistedDate", "Listdt"], inplace=True)
company_info

<>:9: SyntaxWarning: invalid escape sequence '\d'
<>:9: SyntaxWarning: invalid escape sequence '\d'
C:\Users\Collins\AppData\Local\Temp\ipykernel_11072\1536078831.py:9: SyntaxWarning: invalid escape sequence '\d'
  company_info["id2"] = company_info["Stkcd"].astype(str).str.extract('(\d+)')[0].str.zfill(6)

     start_time     id2
0       1991-05  000001
1       1991-02  000002
2       1991-08  000003
3       1991-02  000004
4       1991-01  000005
...         ...     ...
5887    2023-10  920978
5888    2021-12  920981
5889    2023-08  920982
5890    2022-09  920985
5891    2022-11  920992

[5892 rows x 2 columns]

In [490]:
# 如果你的数据格式是"2013-01"这样的字符串
def calculate_survival_time_string(df, time_col='time', id_col='id'):
    """
    适用于时间格式为"YYYY-MM"字符串的情况
    """
    # 确保按时间排序
    df = df.copy().sort_values([id_col, time_col]).reset_index(drop=True)
    
    # 将时间字符串转换为年月整数便于计算
    df['year_month'] = df[time_col].astype(str).apply(
        lambda x: int(x[:4]) * 12 + int(x[5:7]) - 1  # 转换为月份总数
    )
    
    # 计算每个股票的首次出现月份
    first_month = df.groupby(id_col)['year_month'].min().reset_index()
    first_month.columns = [id_col, 'first_month']
    
    # 合并
    df_with_first = pd.merge(df, first_month, on=id_col)
    
    # 计算存续月份数
    df_with_first['survival_months'] = df_with_first['year_month'] - df_with_first['first_month']
    
    # 返回结果（删除辅助列）
    return df_with_first[[time_col, id_col, 'survival_months']]

# df_age_month = calculate_survival_time_string(ret3)

# 先merge

In [491]:
start_time = pd.to_datetime("2014-01-01")
df_all = pd.merge(all_betas[all_betas["time"] >= "2014-01"], df_ivol[df_ivol["time"] >= "2014-01"], on=["time", "id"])
df_all = pd.merge(df_all, retvol, on=["time", "id"])

df_all["id2"] = df_all["id"].str[:6]
df_all = pd.merge(df_all, company_info, on=["id2"], how="left")
# df_all["age"] = (df_all["time"] - df_all["start_time"])

# df_all["age"] = df_all["age"]
# 将time列转换为datetime，假设格式为'%Y-%m'
df_all["time_dt"] = pd.to_datetime(df_all["time"].astype(str), format='%Y-%m')

# 确保start_time是datetime，如果不是则转换
if not pd.api.types.is_datetime64_any_dtype(df_all["start_time"]):
    df_all["start_time"] = pd.to_datetime(df_all["start_time"].astype(str))

# 计算月份差
df_all["age"] = ((df_all["time_dt"].dt.year - df_all["start_time"].dt.year) * 12 + (df_all["time_dt"].dt.month - df_all["start_time"].dt.month))

# df_all["age"] = 1 / df_all["age"]

df_all.drop(columns=["id2", "start_time", "time_dt"], inplace=True)

df_all.head()

      time         id  beta_MKT  residual      ivol       ret    retvol    age
0  2014-01  000001.SZ  0.951051  0.059264  0.030621 -0.069388  0.118736  272.0
1  2014-02  000001.SZ  0.168210 -0.076849  0.050532 -0.023684  0.105144  273.0
2  2014-03  000001.SZ  0.784553  0.003984  0.048681 -0.032345  0.033955  274.0
3  2014-04  000001.SZ  1.838806  0.002951  0.048894  0.034355  0.050524  275.0
4  2014-05  000001.SZ  1.676933  0.005820  0.048662  0.032316  0.044599  276.0

In [492]:
#
# df_all.to_csv("4_proxies.csv")

# 5. DISP
在构建日捕捉，Rptdt，求同股票同时间不同report的标准差

In [493]:
af_df = pd.read_csv("./data/AF_Forecast.csv")
af1_df = pd.read_csv("./data/AF_Forecast1.csv")
af0_df = pd.read_csv("./data/AF_Forecast01.csv")
# af_df.head()

af_df = pd.concat([af0_df, af_df, af1_df], axis=0).drop(columns=["ReportID", "DeclareDate", "Fenddt"])
af_df["time"] = pd.to_datetime(af_df["Rptdt"]).dt.to_period("M")
af_df.drop(columns="Rptdt", inplace=True)

af_df.head()

   Stkcd  Feps     time
0      1  2.34  2013-01
1      1  2.42  2013-01
2      1  2.57  2013-01
3      1  2.42  2013-01
4      1  2.81  2013-01

In [494]:
df_disp = af_df.groupby(["Stkcd", "time"]).std().reset_index()

df_disp["id2"] = df_disp['Stkcd'].astype(str).str.extract('(\d+)')[0].str.zfill(6)
price4["id2"] = price4["id"].str[:6]

df_disp = pd.merge(df_disp, price4, on=["time", "id2"], how="left") 
# price4.head()
df_disp["Feps"] = df_disp["Feps"] / df_disp["price"]
df_disp = df_disp.drop(columns=["id", "date", "price"]).rename(columns={"Feps":"disp"})

df_disp.head()

<>:3: SyntaxWarning: invalid escape sequence '\d'
<>:3: SyntaxWarning: invalid escape sequence '\d'
C:\Users\Collins\AppData\Local\Temp\ipykernel_11072\3391910982.py:3: SyntaxWarning: invalid escape sequence '\d'
  df_disp["id2"] = df_disp['Stkcd'].astype(str).str.extract('(\d+)')[0].str.zfill(6)

   Stkcd     time      disp     id2
0      1  2013-01  0.000358  000001
1      1  2013-02  0.000429  000001
2      1  2013-03  0.001144  000001
3      1  2013-04  0.001103  000001
4      1  2013-08  0.000802  000001

In [495]:
df_all.head()
# 由于分析师数据有不连续部分，选择时间上以df_all为标准

      time         id  beta_MKT  residual      ivol       ret    retvol    age
0  2014-01  000001.SZ  0.951051  0.059264  0.030621 -0.069388  0.118736  272.0
1  2014-02  000001.SZ  0.168210 -0.076849  0.050532 -0.023684  0.105144  273.0
2  2014-03  000001.SZ  0.784553  0.003984  0.048681 -0.032345  0.033955  274.0
3  2014-04  000001.SZ  1.838806  0.002951  0.048894  0.034355  0.050524  275.0
4  2014-05  000001.SZ  1.676933  0.005820  0.048662  0.032316  0.044599  276.0

In [496]:
df_all["id2"] = df_all["id"].str[:6]
df_all = pd.merge(df_all, df_disp, on=["time", "id2"], how="left")
df_all.drop(columns=["id2", "Stkcd"], inplace=True)
df_all.head(20)

,time,id,beta_MKT,residual,ivol,ret,retvol,age,disp
0,2014-01,000001.SZ,0.951051,0.059264,0.030621,-0.069388,0.118736,272.0,0.000419
1,2014-02,000001.SZ,0.168210,-0.076849,0.050532,-0.023684,0.105144,273.0,0.000487
2,2014-03,000001.SZ,0.784553,0.003984,0.048681,-0.032345,0.033955,274.0,0.000767
3,2014-04,000001.SZ,1.838806,0.002951,0.048894,0.034355,0.050524,275.0,0.000708
4,2014-05,000001.SZ,1.676933,0.005820,0.048662,0.032316,0.044599,276.0,NaN
5,2014-06,000001.SZ,1.247306,-0.001726,0.035710,0.048693,0.037076,277.0,NaN
6,2014-07,000001.SZ,1.099266,-0.000016,0.003048,0.096872,0.046243,278.0,0.000570
7,2014-08,000001.SZ,1.065729,-0.023794,0.011784,-0.057038,0.055713,279.0,0.000619
8,2014-09,000001.SZ,0.807453,0.004903,0.012074,-0.010732,0.058615,280.0,NaN
9,2014-10,000001.SZ,0.537311,-0.000947,0.011190,0.087771,0.065850,281.0,0.000379
10,2014-11,000001.SZ,1.149543,0.006503,0.012224,0.127833,0.078774,282.0,NaN
11,2014-12,000001.SZ,1.766643,-0.011194,0.012633,0.273312,0.129074,283.0,0.000258
12,2015-01,000001.SZ,1.966685,-0.003838,0.007125,-0.120581,0.148175,284.0,NaN
13,2015-02,000001.SZ,2.028280,0.040811,0.020325,0.004307,0.146228,285.0,0.000219
14,2015-03,000001.SZ,2.008458,-0.007383,0.021085,0.125804,0.148067,286.0,0.000392
15,2015-04,000001.SZ,2.167871,0.055650,0.031066,0.283263,0.174088,287.0,0.000254
16,2015-05,000001.SZ,2.136533,0.014615,0.027618,-0.082635,0.164786,288.0,0.000278
17,2015-06,000001.SZ,1.226172,-0.003508,0.027547,-0.050914,0.149869,289.0,0.000128
18,2015-07,000001.SZ,1.087167,0.000121,0.025833,-0.149931,0.176642,290.0,0.000259
19,2015-08,000001.SZ,1.065779,0.061336,0.030811,-0.104369,0.173812,291.0,0.000272

In [497]:
# if "disp" in df_all.columns:
#     df_all = df_all.drop(columns="disp")
    
print(df_all["disp"].isna().sum())
df_all_copy = df_all.copy()
df_all_copy = df_all_copy.groupby("id").apply(lambda x: x.sort_values("time")).reset_index(drop=True)
# top2 = df.groupby('A').apply(lambda x: x.sort_values('B').head(2)).reset_index(drop=True)
df_all_copy["disp"] = df_all_copy.groupby("id")["disp"].ffill()
print(df_all_copy["disp"].isna().sum())
df_all_copy.head(10)

df_all = df_all_copy
# df_all

359633
84444

C:\Users\Collins\AppData\Local\Temp\ipykernel_11072\3663094383.py:6: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df_all_copy = df_all_copy.groupby("id").apply(lambda x: x.sort_values("time")).reset_index(drop=True)

In [498]:
df_all.head(20)

,time,id,beta_MKT,residual,ivol,ret,retvol,age,disp
0,2014-01,000001.SZ,0.951051,0.059264,0.030621,-0.069388,0.118736,272.0,0.000419
1,2014-02,000001.SZ,0.168210,-0.076849,0.050532,-0.023684,0.105144,273.0,0.000487
2,2014-03,000001.SZ,0.784553,0.003984,0.048681,-0.032345,0.033955,274.0,0.000767
3,2014-04,000001.SZ,1.838806,0.002951,0.048894,0.034355,0.050524,275.0,0.000708
4,2014-05,000001.SZ,1.676933,0.005820,0.048662,0.032316,0.044599,276.0,0.000708
5,2014-06,000001.SZ,1.247306,-0.001726,0.035710,0.048693,0.037076,277.0,0.000708
6,2014-07,000001.SZ,1.099266,-0.000016,0.003048,0.096872,0.046243,278.0,0.000570
7,2014-08,000001.SZ,1.065729,-0.023794,0.011784,-0.057038,0.055713,279.0,0.000619
8,2014-09,000001.SZ,0.807453,0.004903,0.012074,-0.010732,0.058615,280.0,0.000619
9,2014-10,000001.SZ,0.537311,-0.000947,0.011190,0.087771,0.065850,281.0,0.000379
10,2014-11,000001.SZ,1.149543,0.006503,0.012224,0.127833,0.078774,282.0,0.000379
11,2014-12,000001.SZ,1.766643,-0.011194,0.012633,0.273312,0.129074,283.0,0.000258
12,2015-01,000001.SZ,1.966685,-0.003838,0.007125,-0.120581,0.148175,284.0,0.000258
13,2015-02,000001.SZ,2.028280,0.040811,0.020325,0.004307,0.146228,285.0,0.000219
14,2015-03,000001.SZ,2.008458,-0.007383,0.021085,0.125804,0.148067,286.0,0.000392
15,2015-04,000001.SZ,2.167871,0.055650,0.031066,0.283263,0.174088,287.0,0.000254
16,2015-05,000001.SZ,2.136533,0.014615,0.027618,-0.082635,0.164786,288.0,0.000278
17,2015-06,000001.SZ,1.226172,-0.003508,0.027547,-0.050914,0.149869,289.0,0.000128
18,2015-07,000001.SZ,1.087167,0.000121,0.025833,-0.149931,0.176642,290.0,0.000259
19,2015-08,000001.SZ,1.065779,0.061336,0.030811,-0.104369,0.173812,291.0,0.000272

In [499]:
# df_all.to_csv("5_proxies.csv")

# 6.

In [500]:
# 资产负债表
fs_combas0 = pd.read_csv("./data/FS_Combas.csv")
fs_combas1 = pd.read_csv("./data/FS_Combas1.csv")

# 需要简单筛选
fs_combas0 = fs_combas0[fs_combas0["Typrep"]=="A"].drop(columns=["ShortName", "Typrep"]).rename(columns={"A001101000":"cash", "A001100000":"current_asset", "A002101000":"short_term_debt", "A002100000":"current_liability"})
fs_combas1 = fs_combas1[fs_combas1["Typrep"]=="A"].drop(columns=["ShortName", "Typrep"]).rename(columns={"A001000000":"total_asset"})

# 转换时间戳
fs_combas0["Accper"] = pd.to_datetime(fs_combas0["Accper"]).dt.to_period("M")
fs_combas0.rename(columns={"Accper":"time"}, inplace=True)
fs_combas1["Accper"] = pd.to_datetime(fs_combas1["Accper"]).dt.to_period("M")
fs_combas1.rename(columns={"Accper":"time"}, inplace=True)


fs_combas = pd.merge(fs_combas0, fs_combas1, on=["Stkcd", "time"], how="outer")

print(fs_combas0.shape, fs_combas1.shape, fs_combas.shape)
fs_combas.head()

(276339, 6) (276339, 3) (276339, 7)

,Stkcd,time,cash,current_asset,short_term_debt,current_liability,total_asset
0,1,2010-12,0.0,NaN,0.0,NaN,7.272071e+11
1,1,2011-01,0.0,NaN,0.0,NaN,7.272071e+11
2,1,2011-03,0.0,NaN,0.0,NaN,8.075634e+11
3,1,2011-06,0.0,NaN,0.0,NaN,8.520570e+11
4,1,2011-09,0.0,NaN,0.0,NaN,1.207212e+12

the std of cash flow over the previous 5 years CF = (earnings before extraordinary items - total accruals)/average total assets in the past 2years; total accruals = change in current assets- change in cash - change in currentliabilities - depreciation expense + change in short-term debt.

In [501]:
# total accruals = change in current assets- change in cash - change in currentliabilities-depreciation expense + change in short-term debt.
# 暂时没找到折旧
fs_combas_changes = fs_combas[["Stkcd", "time"]].copy()
for i in ["cash", "current_asset", "short_term_debt", "current_liability"]:
    fs_combas_changes[i+"_chg"] = fs_combas.groupby("Stkcd")[i].diff()
# fs_combas_changes

fs_combas_changes["total_accruals"] = fs_combas_changes["current_asset_chg"] - fs_combas_changes["cash_chg"] - fs_combas_changes["current_liability_chg"] + fs_combas_changes["short_term_debt_chg"]
fs_combas_changes.head()

,Stkcd,time,cash_chg,current_asset_chg,short_term_debt_chg,current_liability_chg,total_accruals
0,1,2010-12,NaN,NaN,NaN,NaN,NaN
1,1,2011-01,0.0,NaN,0.0,NaN,NaN
2,1,2011-03,0.0,NaN,0.0,NaN,NaN
3,1,2011-06,0.0,NaN,0.0,NaN,NaN
4,1,2011-09,0.0,NaN,0.0,NaN,NaN

In [502]:
fi_t6 = pd.read_csv("./data/FI_T6.csv")
fi_t6 = fi_t6[fi_t6["Typrep"]=="A"].drop(columns=["ShortName", "Typrep", "Source"]).rename(columns={"F061201B":"depreciation", "F061201C":"depreciation_TTM"})
fi_t6["Accper"] = pd.to_datetime(fi_t6["Accper"]).dt.to_period("M")
fi_t6.rename(columns={"Accper":"time"}, inplace=True)
fi_t6.head()

   Stkcd     time  depreciation  depreciation_TTM
0      1  2010-12   492452000.0       492452000.0
1      1  2011-03           NaN               NaN
2      1  2011-06   272242000.0       534683000.0
3      1  2011-09           NaN               NaN
5      1  2011-12   909860000.0       909860000.0

In [503]:
# total_accrual data
df_ta = pd.merge(fs_combas_changes, fi_t6, on=["Stkcd", "time"], how="left")

df_ta.head()

,Stkcd,time,cash_chg,current_asset_chg,short_term_debt_chg,current_liability_chg,total_accruals,depreciation,depreciation_TTM
0,1,2010-12,NaN,NaN,NaN,NaN,NaN,492452000.0,492452000.0
1,1,2011-01,0.0,NaN,0.0,NaN,NaN,NaN,NaN
2,1,2011-03,0.0,NaN,0.0,NaN,NaN,NaN,NaN
3,1,2011-06,0.0,NaN,0.0,NaN,NaN,272242000.0,534683000.0
4,1,2011-09,0.0,NaN,0.0,NaN,NaN,NaN,NaN

In [504]:
# df_ta_copy = df_ta.copy()
# df_ta_copy["time"] = df_ta_copy["time"].dt.to_timestamp()
# df_ta_copy = df_ta_copy.set_index(['Stkcd', 'time'])
# df_ta_copy = df_ta_copy.groupby('Stkcd', group_keys=False).resample('M').ffill().reset_index()
# df_ta_copy

In [505]:
df_ta_copy = df_ta.copy()

def fill_quarter_to_month(df):
    """
    将季度数据填充到月度，确保所有月份都有数据
    """
    df = df.copy()
    
    # 转换时间格式
    df['time'] = df['time'].dt.to_timestamp()
    
    results = []
    
    # 对每个股票单独处理
    for stkcd, group in df.groupby('Stkcd'):
        # 按时间排序
        group = group.sort_values('time')
        
        # 生成完整的月度时间范围
        min_date = group['time'].min()
        max_date = group['time'].max()
        
        # 创建完整的月度日期序列
        all_months = pd.date_range(
            start=min_date,
            end=max_date,
            freq='MS'  # 月初
        )
        
        # 创建包含所有月份的DataFrame
        full_df = pd.DataFrame({
            'Stkcd': stkcd,
            'time': all_months
        })
        
        # 合并原始数据
        merged = pd.merge(
            full_df,
            group,
            on=['Stkcd', 'time'],
            how='left'
        )
        
        # 向前填充所有数值列
        numeric_cols = merged.select_dtypes(include=[np.number]).columns
        merged[numeric_cols] = merged[numeric_cols].ffill()
        
        results.append(merged)
    
    # 合并所有股票
    result_df = pd.concat(results, ignore_index=True)
    
    # 按股票和时间排序
    result_df = result_df.sort_values(['Stkcd', 'time']).reset_index(drop=True)
    
    return result_df

# 使用推荐方案
df_ta_copy = fill_quarter_to_month(df_ta_copy)

# 计算 total_accrual
df_ta_copy["total_accruals"] = df_ta_copy["current_asset_chg"] - df_ta_copy["cash_chg"] - df_ta_copy["current_liability_chg"] - df_ta_copy["depreciation_TTM"] - df_ta_copy["short_term_debt_chg"] - df_ta_copy["depreciation_TTM"]


df_total_accruals = df_ta_copy[["Stkcd", "time", "total_accruals"]]
df_total_accruals["time"] = df_total_accruals["time"].dt.to_period("M")

df_ta_copy.head()

C:\Users\Collins\AppData\Local\Temp\ipykernel_11072\195484873.py:66: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_total_accruals["time"] = df_total_accruals["time"].dt.to_period("M")

,Stkcd,time,cash_chg,current_asset_chg,short_term_debt_chg,current_liability_chg,total_accruals,depreciation,depreciation_TTM
0,1,2010-12-01,NaN,NaN,NaN,NaN,NaN,492452000.0,492452000.0
1,1,2011-01-01,0.0,NaN,0.0,NaN,NaN,492452000.0,492452000.0
2,1,2011-02-01,0.0,NaN,0.0,NaN,NaN,492452000.0,492452000.0
3,1,2011-03-01,0.0,NaN,0.0,NaN,NaN,492452000.0,492452000.0
4,1,2011-04-01,0.0,NaN,0.0,NaN,NaN,492452000.0,492452000.0

In [506]:
df_total_accruals

         Stkcd     time  total_accruals
0            1  2010-12             NaN
1            1  2011-01             NaN
2            1  2011-02             NaN
3            1  2011-03             NaN
4            1  2011-04             NaN
...        ...      ...             ...
692161  920992  2025-05    4.293939e+08
692162  920992  2025-06   -6.705449e+07
692163  920992  2025-07   -6.705449e+07
692164  920992  2025-08   -6.705449e+07
692165  920992  2025-09   -1.927740e+08

[692166 rows x 3 columns]

## avg total asset

In [507]:
# avg total asset
df_ata = fs_combas[["Stkcd", "time", "total_asset"]].copy()

# rollng mean 即可
df_ata["ta_mean_2"] = df_ata["total_asset"].rolling(2).mean()

df_ata.drop(columns=["total_asset"], inplace=True)

# 转换时间列
df_ata["time"] = df_ata["time"].dt.to_timestamp()

# 使用 pd.Grouper 进行分组重采样
df_ata = (
    df_ata
    .groupby(['Stkcd', pd.Grouper(key='time', freq='M')])
    .first()  # 获取每个股票每月的数据
    .groupby('Stkcd')
    .ffill()  # 向前填充缺失的月份
    .reset_index()
)

df_ata["time"] = df_ata["time"].dt.to_period("M")

df_ata.head()

C:\Users\Collins\AppData\Local\Temp\ipykernel_11072\4105010522.py:15: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  .groupby(['Stkcd', pd.Grouper(key='time', freq='M')])

   Stkcd     time     ta_mean_2
0      1  2010-12           NaN
1      1  2011-01  7.272071e+11
2      1  2011-03  7.673853e+11
3      1  2011-06  8.298102e+11
4      1  2011-09  1.029635e+12

In [508]:
date_range = pd.period_range(start='2010-12', end='2025-10', freq='M')

# 为每个股票创建完整的时间序列
all_combinations = pd.MultiIndex.from_product(
    [df_ata.copy()['Stkcd'].unique(), date_range],
    names=['Stkcd', 'time']
)

# 重新索引
df_ata_1 = df_ata.copy().set_index(['Stkcd', 'time']).reindex(all_combinations).reset_index().drop(columns="ta_mean_2")

df_ata_1 = pd.merge(df_ata_1, df_ata, on=["Stkcd", "time"], how="left")

# 向后填充（限制为2个月）
df_ata_1['ta_mean_2'] = df_ata_1.copy().groupby('Stkcd')['ta_mean_2'].transform(lambda x: x.fillna(method='ffill'))

df_ata_1

C:\Users\Collins\AppData\Local\Temp\ipykernel_11072\3873868491.py:15: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_ata_1['ta_mean_2'] = df_ata_1.copy().groupby('Stkcd')['ta_mean_2'].transform(lambda x: x.fillna(method='ffill'))

          Stkcd     time     ta_mean_2
0             1  2010-12           NaN
1             1  2011-01  7.272071e+11
2             1  2011-02  7.272071e+11
3             1  2011-03  7.673853e+11
4             1  2011-04  7.673853e+11
...         ...      ...           ...
1017968  920992  2025-06  7.365006e+08
1017969  920992  2025-07  7.365006e+08
1017970  920992  2025-08  7.365006e+08
1017971  920992  2025-09  7.282270e+08
1017972  920992  2025-10  7.282270e+08

[1017973 rows x 3 columns]

## 营业利润

In [509]:
# 营业利润
fs_comins = pd.read_csv("./data/FS_Comins.csv")
fs_comins = fs_comins[fs_comins["Typrep"] == "A"].drop(columns=["ShortName", "Typrep"]).rename(columns={"B001300000":"earning"})
fs_comins["Accper"] = pd.to_datetime(fs_comins["Accper"]).dt.to_period("M")
fs_comins.rename(columns={"Accper":"time"}, inplace=True)

fs_comins.head()

   Stkcd     time       earning
0      1  2010-12  7.849555e+09
1      1  2011-01  7.799948e+09
3      1  2011-03  3.059957e+09
4      1  2011-06  6.049894e+09
5      1  2011-09  9.818861e+09

In [510]:
df_earning = fs_comins.copy().set_index(['Stkcd', 'time']).reindex(all_combinations).reset_index().drop(columns="earning")
df_earning = pd.merge(df_earning, fs_comins, on=["Stkcd", "time"], how="left")

df_earning['earning'] = df_earning.copy().groupby('Stkcd')['earning'].transform(lambda x: x.fillna(method='ffill'))

df_earning

C:\Users\Collins\AppData\Local\Temp\ipykernel_11072\2967216801.py:4: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_earning['earning'] = df_earning.copy().groupby('Stkcd')['earning'].transform(lambda x: x.fillna(method='ffill'))

          Stkcd     time       earning
0             1  2010-12  7.849555e+09
1             1  2011-01  7.799948e+09
2             1  2011-02  7.799948e+09
3             1  2011-03  3.059957e+09
4             1  2011-04  3.059957e+09
...         ...      ...           ...
1017968  920992  2025-06  1.135353e+07
1017969  920992  2025-07  1.135353e+07
1017970  920992  2025-08  1.135353e+07
1017971  920992  2025-09  1.329351e+07
1017972  920992  2025-10  1.329351e+07

[1017973 rows x 3 columns]

In [511]:
# calc the proxy

# merge the 3 dfs
# df_earning, df_ata_1, df_total_accruals
df_cf = pd.merge(df_earning, df_ata_1, on=["Stkcd" ,"time"])
df_cf = pd.merge(df_cf, df_total_accruals, on=["Stkcd" ,"time"])
df_cf

         Stkcd     time       earning     ta_mean_2  total_accruals
0            1  2010-12  7.849555e+09           NaN             NaN
1            1  2011-01  7.799948e+09  7.272071e+11             NaN
2            1  2011-02  7.799948e+09  7.272071e+11             NaN
3            1  2011-03  3.059957e+09  7.673853e+11             NaN
4            1  2011-04  3.059957e+09  7.673853e+11             NaN
...        ...      ...           ...           ...             ...
692161  920992  2025-05  5.288708e+06  7.445538e+08    4.293939e+08
692162  920992  2025-06  1.135353e+07  7.365006e+08   -6.705449e+07
692163  920992  2025-07  1.135353e+07  7.365006e+08   -6.705449e+07
692164  920992  2025-08  1.135353e+07  7.365006e+08   -6.705449e+07
692165  920992  2025-09  1.329351e+07  7.282270e+08   -1.927740e+08

[692166 rows x 5 columns]

the std of cash flow over the previous 5 years CF = (earnings before extraordinary items - total accruals)/average total assets in the past 2years

In [512]:
df_cf["cf"] = (df_cf["earning"] - df_cf["total_accruals"]) / df_cf["ta_mean_2"]
df_cf["CFVOL"] = df_cf["cf"].rolling(24).std()      # 没预留够5年的空间，缩短点时间吧，这个以后改

df_cf["id2"] = df_cf['Stkcd'].astype(str).str.extract('(\d+)')[0].str.zfill(6)
df_cf.head()

<>:4: SyntaxWarning: invalid escape sequence '\d'
<>:4: SyntaxWarning: invalid escape sequence '\d'
C:\Users\Collins\AppData\Local\Temp\ipykernel_11072\4141371790.py:4: SyntaxWarning: invalid escape sequence '\d'
  df_cf["id2"] = df_cf['Stkcd'].astype(str).str.extract('(\d+)')[0].str.zfill(6)

,Stkcd,time,earning,ta_mean_2,total_accruals,cf,CFVOL,id2
0,1,2010-12,7.849555e+09,NaN,NaN,NaN,NaN,000001
1,1,2011-01,7.799948e+09,7.272071e+11,NaN,NaN,NaN,000001
2,1,2011-02,7.799948e+09,7.272071e+11,NaN,NaN,NaN,000001
3,1,2011-03,3.059957e+09,7.673853e+11,NaN,NaN,NaN,000001
4,1,2011-04,3.059957e+09,7.673853e+11,NaN,NaN,NaN,000001

In [513]:
df_cf.tail()

,Stkcd,time,earning,ta_mean_2,total_accruals,cf,CFVOL,id2
692161,920992,2025-05,5288708.09,7.445538e+08,4.293939e+08,-0.569610,0.355536,920992
692162,920992,2025-06,11353533.55,7.365006e+08,-6.705449e+07,0.106460,0.355590,920992
692163,920992,2025-07,11353533.55,7.365006e+08,-6.705449e+07,0.106460,0.355643,920992
692164,920992,2025-08,11353533.55,7.365006e+08,-6.705449e+07,0.106460,0.355697,920992
692165,920992,2025-09,13293510.14,7.282270e+08,-1.927740e+08,0.282972,0.356954,920992

## merge

In [514]:
df_all_2 = df_all.copy()
df_all_2["id2"] = df_all_2["id"].str[:6]

df_all_2 = pd.merge(df_all_2, df_cf[["id2", "time", "CFVOL"]], on=["id2", "time"], how="left").drop(columns="id2")
df_all_2

,time,id,beta_MKT,residual,ivol,ret,retvol,age,disp,CFVOL
0,2014-01,000001.SZ,0.951051,5.926419e-02,3.062121e-02,-0.069388,0.118736,272.0,0.000419,NaN
1,2014-02,000001.SZ,0.168210,-7.684917e-02,5.053159e-02,-0.023684,0.105144,273.0,0.000487,NaN
2,2014-03,000001.SZ,0.784553,3.984428e-03,4.868126e-02,-0.032345,0.033955,274.0,0.000767,NaN
3,2014-04,000001.SZ,1.838806,2.950958e-03,4.889417e-02,0.034355,0.050524,275.0,0.000708,NaN
4,2014-05,000001.SZ,1.676933,5.819541e-03,4.866165e-02,0.032316,0.044599,276.0,0.000708,NaN
...,...,...,...,...,...,...,...,...,...,...
495180,2024-04,T00018.SH,0.000037,1.619884e-06,3.511122e-06,0.000000,0.000000,NaN,NaN,NaN
495181,2024-05,T00018.SH,0.000020,-7.428163e-07,8.483296e-07,0.000000,0.000000,NaN,NaN,NaN
495182,2024-06,T00018.SH,-0.000083,8.603900e-08,8.565356e-07,0.000000,0.000000,NaN,NaN,NaN
495183,2024-07,T00018.SH,-0.000105,1.101494e-06,9.133222e-07,0.000000,0.000000,NaN,NaN,NaN
495184,2024-08,T00018.SH,-0.000082,-1.583485e-07,9.610934e-07,0.000000,0.000000,NaN,NaN,NaN

In [515]:
(1- df_all_2["CFVOL"].isna()).sum()

np.int64(400277)

In [516]:
df_all_2.to_csv("6_proxies_window5month.csv")